       IDENTIFICATION DIVISION.
       PROGRAM-ID. "ADDITION".

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 FIRST-NO PIC 99 VALUE 20.
       01 SECOND-NO PIC 99 VALUE 30.
       01 RESULT PIC 9(3) VALUE 0.
       01 REM PIC 99 VALUE 0.

       PROCEDURE DIVISION.
       
           DISPLAY "FIRST-NO : " FIRST-NO.
           DISPLAY "SECOND-NO : " SECOND-NO.

           ADD FIRST-NO TO SECOND-NO GIVING RESULT.
           ADD FIRST-NO SECOND-NO TO RESULT.
           DISPLAY "ADDITION : " RESULT.

           SUBTRACT SECOND-NO FROM FIRST-NO GIVING RESULT.
           DISPLAY "SUBSTRACTION : " RESULT

           MULTIPLY FIRST-NO BY SECOND-NO GIVING RESULT.
           DISPLAY "MULTIPLICATION : " RESULT.

           DIVIDE SECOND-NO BY FIRST-NO GIVING RESULT REMAINDER REM.
           DISPLAY "DIVIDE : " RESULT " REMAINDER : " REM.
           
           STOP RUN.
