       IDENTIFICATION DIVISION.
       PROGRAM-ID. STUDENTAVG.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 MARKS.
          05 STUDENT-MARK PIC 9(3) OCCURS 5 TIMES.

       01 TOTAL-MARKS PIC 9(4) VALUE 0.
       01 AVG-MARKS   PIC 9(3)V9.
       01 IDX         PIC 9 VALUE 1.

       PROCEDURE DIVISION.

           PERFORM VARYING IDX FROM 1 BY 1 UNTIL IDX > 5
               DISPLAY "ENTER MARKS FOR STUDENT " IDX ": "
               ACCEPT STUDENT-MARK(IDX)
               ADD STUDENT-MARK(IDX) TO TOTAL-MARKS
           END-PERFORM

           COMPUTE AVG-MARKS = TOTAL-MARKS / 5

           DISPLAY "TOTAL MARKS: " TOTAL-MARKS
           DISPLAY "AVERAGE MARKS: " AVG-MARKS

           STOP RUN.