       IDENTIFICATION DIVISION.
       PROGRAM-ID. BANKSYSTEM.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 ACCOUNT-NUMBER PIC 9(6).
       01 BALANCE        PIC 9(6)V99.
       01 WITHDRAW-AMT   PIC 9(5)V99.

       PROCEDURE DIVISION.

           DISPLAY "ENTER ACCOUNT NUMBER: ".
           ACCEPT ACCOUNT-NUMBER.

           DISPLAY "ENTER CURRENT BALANCE: ".
           ACCEPT BALANCE.

           DISPLAY "ENTER WITHDRAW AMOUNT: ".
           ACCEPT WITHDRAW-AMT.

           IF WITHDRAW-AMT > BALANCE
               DISPLAY "INSUFFICIENT BALANCE"
           ELSE
               SUBTRACT WITHDRAW-AMT FROM BALANCE
               DISPLAY "UPDATED BALANCE: " BALANCE
           END-IF.

           STOP RUN.