       01 KSDS-USER-REC.
           05 USER-ID PIC 999.
           05 FILLER PIC X(2).
           05 USER-NAME PIC A(10).
           05 FILLER PIC X(2).
           05 USER-EMAIL PIC X(25).
           05 FILLER PIC X(2).
           05 USER-PASSWORD PIC X(15).
